{
        "title": "Audit Log for AppGini",
        "name": "Audit",
        "icon": "report_magnify.png",
        "Author": "Olaf - @onoehring",
        "Date": "07/14/2014",
        "Updated": "19/01/20",
        "Version": "1.76",
        "product_use": "5.93",
        "info": "<ul><li>Adjustments by Olaf Nöhring, 2021-02 (https://datenbank-projekt.de) for v1.76:<ul><li>Fixed and updated manual installation _init code</li><li>added AppGini Code for Auditor table for easy, quick and correct creation of the auditor table in your AppGini application.</li><li>cooperation with landinialejandro to make code cleaner for use in installation plugin</li></ul></li><li>Adjustments by Olaf Nöhring, 2021-01 (https://datenbank-projekt.de) for v1.74:<ul><li>Added example screenshots of Audit Log view to docs</li><li>Added hint how to deal with the need for exact position of audit-log calls</li></ul></li><li>Adjustments by Olaf Nöhring, 2021-01 (https://datenbank-projekt.de) for v1.73:<ul><li>Adjusted docs for more clarity</li></ul></li><li>Adjustments by Olaf Nöhring, 2021-01 (https://datenbank-projekt.de) for v1.72:<ul><li>Added link to docs for the wonderful plugin extension from landinialejandro which installation a walk in the park. Please see below<li>Modified file structure of the zip files that holds the audit log to adjust for use in combination with the plugin.<li>Changed formatting of the docs for better readability</li><li>Restructured docs for plugin</li><li>Added hint for auditor tablename to docs</li></ul></li></ul>version 1.71 of the auditor.<ul><li>added possibility to easily define the name of your auditor table in the beginning of the the files auditLog_functions.php and /admin/auditLog.php</li><li>changed code in the way that now the order of fields in the database must not match the order of fields in your AppGini application anymore. In previous versions the order must be the same, otherwise it would mess up the logging. Now this problem should be solved.</li><li>added a new function Audit_Manually which allows checking for changes on another table and documenting those (see description below for more information).</li><li>transformed docs to PDF for easier editing</li><li>changed audit_tableSQL.sql to make larger fields for table and fieldnames</li></ul>"
}

